Конфигурация отчетов/Documents/Документ1.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Документ1</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заведение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Заведение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация отчетов/Enums/СтандартныеСтатьи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтандартныеСтатьи</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОбщаяКасса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КассаКухня</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КассаБар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доставка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Терминал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Карта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Десерты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Хлеб</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Дизель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Топливо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтиркаПаустовского</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Анжела</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Стирка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОставленоНаЗакупку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СуммаРасходов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОставленоЗакупщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КассаОфициантов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация отчетов/Documents/Документ1/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПолучитьОтчетаНаСервере()
	ОбщаяКасса=0;
	СуммаДесертов=0;
	СуммаХлеба=0;
	СуммаДизеля=0;
	СуммаРасходов=0;
	СуммаПеребора=0;
	СуммаПроцентов=0;
	
	
	Заведние = Объект.Заведение;
	ДатаС=Объект.ДатаС;
	ДатаПо=Объект.ДатаПо;
	
	
	Отчет = Документы.ДневнойОтчет.Выбрать(ДатаС,ДатаПо);
	
	Пока Отчет.Следующий() Цикл
		ТекущийОтчет = Отчет.ПолучитьОбъект();
		Если ТекущийОтчет.Заведение = Объект.Заведение Тогда
			Для Каждого Выборка Из ТекущийОтчет.ОсновнаяИнформация Цикл 
				Если Выборка.Статья.СтандартнаяСтатья = Перечисления.СтандартныеСтатьи.ОбщаяКасса Тогда
					ОбщаяКасса=ОбщаяКасса+Выборка.Сумма;
					
				ИначеЕсли Выборка.Статья.СтандартнаяСтатья = Перечисления.СтандартныеСтатьи.Десерты Тогда
					СуммаДесертов=СуммаДесертов+Выборка.Сумма;	
				ИначеЕсли Выборка.Статья.СтандартнаяСтатья = Перечисления.СтандартныеСтатьи.Хлеб Тогда
					СуммаХлеба=СуммаХлеба+Выборка.Сумма;	
				ИначеЕсли Выборка.Статья.СтандартнаяСтатья = Перечисления.СтандартныеСтатьи.Дизель Тогда	
					СуммаДизеля=СуммаДизеля+Выборка.Сумма;	
				КонецЕсли;
			КонецЦикла;
			
			Для Каждого Выборка Из ТекущийОтчет.Расходы Цикл
				СуммаРасходов=СуммаРасходов+Выборка.Сумма;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	

//	
//	Пока Выборка.Следующий() Цикл
//		СуммаРасходов=СуммаРасходов+Выборка.СуммаРасхода;	
//	КонецЦикла;
//	
//		
	СуммаПроцентов=(ОбщаяКасса-СуммаХлеба-СуммаДесертов)*0.2;
	СуммаПеребора=СуммаПроцентов-(СуммаРасходов+СуммаДизеля);
	Сообщить("Общая касса "+Строка(ОбщаяКасса)+", сумма хлеба "+Строка(СуммаХлеба)+", сумма десертов "+Строка(СуммаДесертов)
		+", сумма дизеля "+Строка(СуммаДизеля)+", сумма расходов "+Строка(СуммаРасходов)+", сумма процентов "+Строка(СуммаПроцентов)
		+", сумма перебора "+Строка(СуммаПеребора));

	
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьОтчета(Команда)
	ПолучитьОтчетаНаСервере();
КонецПроцедуры
